app/views/messages/index.html.erb

  <% if message.body %>
     <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]