app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build(comment_params)
    @topic = @comment.topic
    @comments = @topic.comments
    @notification = @comment.notifications.build(user_id: @topic.user.id)
    respond_to do |format|
      if @comment.save
        format.html {redirect_to topic_path(@topic), notice: 'コメントを投稿しました。'}
        format.js { render :index }
        unless @comment.topic.user_id == current_user.id
         Pusher.trigger("user_#{@comment.topic.user_id}_channel",'comment_created',{message: 'あなたの投稿にコメントが付きました'})
        end
        Pusher.trigger("user_#{@comment.topic.user_id}_channel",'notification_created',{unread_counts: Notification.where(user_id: @comment.topic.user.id, read: false).count})
---
INSERT INTO "comments" ("topic_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["topic_id", 1], ["content", "nn"], ["user_id", 2], ["created_at", "2017-06-25 11:17:22.271790"], ["updated_at", "2017-06-25 11:17:22.271790"]]
INSERT INTO "notifications" ("user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["comment_id", 1], ["created_at", "2017-06-25 11:17:22.286026"], ["updated_at", "2017-06-25 11:17:22.286026"]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 2 AND "notifications"."read" = $1  [["read", "f"]]

  def update
    @comment = Comment.find(params[:id])
    @topic = @comment.topic
    @comments = @topic.comments
    respond_to do |format|
      if @comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "nnll"], ["updated_at", "2017-06-25 11:17:33.948814"], ["id", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    @topic = @comment.topic
    @comments = @topic.comments
    respond_to do |format|
      if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]