app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"  ORDER BY "topics"."updated_at" DESC
---
  def index
    @topics = Topic.all

SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = $1  [["topic_id", 1]]
UPDATE "notifications" SET "read" = 't' WHERE "notifications"."comment_id" IN (SELECT "comments"."id" FROM "comments" WHERE "comments"."topic_id" = $1)  [["topic_id", 1]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 2 AND "notifications"."read" = $1  [["read", "f"]]
---
  def show
    @comment = @topic.comments.build
    @comments = @topic.comments
    #Notification.find(params[:notification_id]).update(read: true) if params[:notification_id]
    if params[:notification_id]
      notifications = Notification.where(comment: @comments)
      notifications.update_all(read: true)
      @notifications_count = Notification.where(user_id: current_user).where(read: false).count

INSERT INTO "topics" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "oooo"], ["content", "ooo"], ["user_id", 2], ["created_at", "2017-06-25 11:15:13.896523"], ["updated_at", "2017-06-25 11:15:13.896523"]]
---
  def create
    @topic = Topic.new(topics_params)
    @topic.user_id = current_user.id
    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "content" = $1, "updated_at" = $2 WHERE "topics"."id" = $3  [["content", ",,,l"], ["updated_at", "2017-06-25 14:41:24.408972"], ["id", 2]]
---
  def update
    if @topic.update(topics_params)

DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 2]]
---
  def destroy
    @topic.destroy

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1  ORDER BY "topics"."updated_at" DESC LIMIT 1  [["id", 2]]
---
   def set_topic
     @topic = Topic.find(params[:id])